lib/stripe_model_callbacks/fixtures/stripe_events/customer/customer.subscription.created.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.created",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-02-06",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1517764446,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": 1517764476,
      "collection_method": "charge_automatically",
      "created": 1517764446,
      "current_period_end": 1520183646,
      "current_period_start": 1517764446,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
        {
          "id": "txr_1I1qD2AT5SYrvIfd69tAvJe2",
          "object": "tax_rate",
          "active": true,
          "created": 1608802452,
          "description": null,
          "display_name": "VAT DK",
          "inclusive": false,
          "jurisdiction": null,
          "livemode": false,
          "metadata": {},
          "percentage": 25.0
        }
      ],
      "discount": null,
      "ended_at": 1517764476,
      "invoice_customer_balance_settings": {
        "consume_applied_balance_on_void": true
      },
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1517764446,
            "metadata": {
            },
            "price": {
              "id": "large_00000000000000",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1517762943,
              "currency": "dkk",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_00000000000000",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 10000,
              "unit_amount_decimal": "10000"
            },
            "quantity": 1,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_CGNpFmtIMKpiIN"
      },
      "latest_invoice": null,
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "schedule": null,
      "start": 1517764446,
      "start_date": 1517764446,
      "status": "canceled",
      "tax_percent": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    }
  }
}
